## 제가 작성하는 모든 코드는 나중에 공유드립니다.

In [ ]:
import os
os.getcwd() # <-- 이 코드 실행 결과에 나오는 주소에 실습 파일이 있어야 함.

In [ ]:
os.listdir() # 이 코드 실행 결과에서 읽어오고자 하는 파일이 보여야 함.

In [1]:
import pandas as pd
import numpy as np

In [3]:
df_s = pd.DataFrame(dict(v1 = [100, 200, 300],
                         v2 = [400, 500, 600],
                         shape = ["A", "B", "C"]))
df_s

    v1   v2 shape
0  100  400     A
1  200  500     B
2  300  600     C

In [4]:
df_s.iloc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B

In [5]:
df_s.loc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B
2  300  600     C

In [6]:
df_s.v1

0    100
1    200
2    300
Name: v1, dtype: int64

In [7]:
df_s.shape

(3, 3)

In [8]:
df_s["shape"]

0    A
1    B
2    C
Name: shape, dtype: object

In [9]:
df_s.iloc[:, :-1]

    v1   v2
0  100  400
1  200  500
2  300  600

In [10]:
df_s.loc[:, "v2":]

    v2 shape
0  400     A
1  500     B
2  600     C

In [12]:
df_s.loc[df_s["v1"] == 200, ]

    v1   v2 shape
1  200  500     B

In [13]:
df_s.loc[df_s["v1"] != 200, ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [14]:
df_s["v1"] == 200

0    False
1     True
2    False
Name: v1, dtype: bool

In [15]:
~(df_s["v1"] == 200)

0     True
1    False
2     True
Name: v1, dtype: bool

In [16]:
df_s.loc[~(df_s["v1"] == 200), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [17]:
df_s.loc[(df_s["v1"] == 200) & (df_s["v2"] == 600), ]

Empty DataFrame
Columns: [v1, v2, shape]
Index: []

In [18]:
df_s.loc[(df_s["v1"] == 200) | (df_s["v2"] == 600), ]

    v1   v2 shape
1  200  500     B
2  300  600     C

In [19]:
condi_1 = df_s["v1"] == 200
condi_2 = df_s["v2"] == 500
df_s.loc[condi_1 & condi_2, ]

    v1   v2 shape
1  200  500     B

In [ ]:
df_s.loc[(df_s["shape"] == "A") | (df_s["shape"] == "C"), ]

In [20]:
df_s.loc[df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [22]:
df_s.loc[~df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
1  200  500     B

In [ ]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

In [ ]:
df_sub = df.loc[df["지수명"] == "KRX 300", ]
df_sub

In [33]:
df.loc[df["종가"] == df["종가"].max(), ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [34]:
df["종가"].idxmax()

117

In [35]:
df.loc[df["종가"].idxmax(), ["지수명", "종가", "날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [36]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [ ]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()
df_sub

In [47]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  5 non-null      float64
 1   Sepal.Width   4 non-null      float64
 2   Petal.Length  4 non-null      float64
 3   Petal.Width   5 non-null      float64
 4   Species       5 non-null      object
dtypes: float64(4), object(1)
memory usage: 332.0+ bytes

In [ ]:
df_sub.count()

In [49]:
len(df_sub)

5

In [51]:
df_sub.shape[0]

5

In [52]:
df_sub.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [54]:
df_sub.isna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False

In [55]:
df_sub.isna().sum()

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [56]:
df_sub.isna().sum(axis = 1)

0    2
1    0
2    0
3    0
4    0
dtype: int64

In [57]:
df_sub1 = df_sub.loc[df_sub["Sepal.Width"].isna(), ]
df_sub1

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa

In [58]:
df_sub2 = df_sub.loc[df_sub["Sepal.Width"].notna(), ]
df_sub2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [59]:
df_sub3 = df_sub.dropna()
df_sub3

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df_sub.loc[:, "Sepal.Width"] = df_sub["Sepal.Width"].fillna(-999)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())
df_sub

In [70]:
# df_sub2 = df.tail().copy()
df_sub2 = df.tail().reset_index(drop = True)
df_sub2["Petal.Length"] = df_sub2["Petal.Length"].fillna(df_sub2["Petal.Length"].mean())
df_sub2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0           6.7          3.0         5.200          2.3  virginica
1           NaN          2.5         5.225          NaN  virginica
2           6.5          3.0         5.200          2.0  virginica
3           6.2          3.4         5.400          2.3  virginica
4           5.9          3.0         5.100          NaN  virginica

In [74]:
df.tail().set_index("Species").reset_index() # 기존 변수의 위치에 관계 없이 가장 앞으로 옮김.

     Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  virginica           6.7          3.0           5.2          2.3
1  virginica           NaN          2.5           NaN          NaN
2  virginica           6.5          3.0           5.2          2.0
3  virginica           6.2          3.4           5.4          2.3
4  virginica           5.9          3.0           5.1          NaN

* 정렬: https://datadoctorblog.com/2023/04/25/Py-Basic-Pandas-Sorting/
* 원소/조합 세기: https://datadoctorblog.com/2023/04/04/Py-Basic-Pandas-Counting/

In [ ]:
df = pd.read_csv("bike.csv")
df.head(2)

In [79]:
df["season"].unique()

array([1, 2, 3, 4])

In [80]:
df["season"].drop_duplicates()

0       1
1323    2
2690    3
4055    4
Name: season, dtype: int64

In [82]:
# df.iloc[1320:1325, ]

In [83]:
df["season"].nunique()

4

In [ ]:
df["season"].value_counts()

In [85]:
df["season"].value_counts().sort_index()

season
1    2686
2    2733
3    2733
4    2734
Name: count, dtype: int64

In [86]:
df["season"].value_counts(normalize = True)

season
4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: proportion, dtype: float64

In [ ]:
df[["season", "holiday"]].drop_duplicates()

* crosstab(): https://datadoctorblog.com/2023/05/06/Py-Basic-Pandas-Crosstab/

In [88]:
pd.crosstab(df["season"], df["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [ ]:
df = pd.read_csv("diamonds.csv")
df.head(2)

In [ ]:
df.groupby("cut")["price"].max()

In [ ]:
df_g1 = df.groupby("cut")["price"].max().reset_index()
df_g1

In [ ]:
df_g2 = df.groupby(["cut", "color"])["price"].max().reset_index()
df_g2.head()

In [ ]:
df_g3 = df.groupby("cut")[["price", "carat"]].max().reset_index()
df_g3

In [ ]:
df_g4 = df.groupby("cut")["price"].agg(["min", "max"]).reset_index()
df_g4

In [ ]:
df_g5 = df.groupby("cut")["price"].agg(["mean", "std"]).reset_index()
df_g5["cv"] = df_g5["std"] / df_g5["mean"] * 100 # 변동계수
df_g5

* .groupby(): https://datadoctorblog.com/2023/04/28/Py-Basic-Pandas-Groupby/

In [103]:
df_g6 = df.groupby("cut")[["price", "carat"]].agg({"price": "mean", "carat": "max"}).reset_index() # 🎯🎯
df_g6

         cut        price  carat
0       Fair  4358.757764   5.01
1       Good  3928.864452   3.01
2      Ideal  3457.541970   3.50
3    Premium  4584.257704   4.01
4  Very Good  3981.759891   4.00

In [ ]:
df_tx = pd.DataFrame(dict(v1 = [100, 200, 300],
                          v2 = ["abc", "aaa", "ccc"], 
                          v3 = [123, "1234-5678", "010-1234-5678"]))
df_tx

In [105]:
df_tx["v2"].replace("a", "🔥")

0    abc
1    aaa
2    ccc
Name: v2, dtype: object

In [106]:
df_tx["v2"].replace("aaa", "🔥")

0    abc
1      🔥
2    ccc
Name: v2, dtype: object

In [107]:
df_tx["v2"].replace({"aaa": "🔥", "ccc": "💎"})

0    abc
1      🔥
2      💎
Name: v2, dtype: object

In [108]:
df_tx["v2"].str.replace("a", "🔥")

0    🔥bc
1    🔥🔥🔥
2    ccc
Name: v2, dtype: object

In [109]:
df_tx["v2"].str.replace("aaa", "🔥")

0    abc
1      🔥
2    ccc
Name: v2, dtype: object

In [110]:
df_tx["v2"].str.contains("a")

0     True
1     True
2    False
Name: v2, dtype: bool

In [112]:
df_tx["v2"].str.contains("a").sum()

np.int64(2)

In [111]:
~df_tx["v2"].str.contains("a")

0    False
1    False
2     True
Name: v2, dtype: bool

In [ ]:
df_tx.loc[df_tx["v2"].str.contains("a"), ]

In [ ]:
df_tx.loc[~df_tx["v2"].str.contains("a"), ]

In [115]:
df_tx["v3"].str.split("-")

0                  NaN
1         [1234, 5678]
2    [010, 1234, 5678]
Name: v3, dtype: object

In [116]:
df_tx["v4"] = df_tx["v3"].astype("str")

In [117]:
df_tx

    v1   v2             v3             v4
0  100  abc            123            123
1  200  aaa      1234-5678      1234-5678
2  300  ccc  010-1234-5678  010-1234-5678

In [ ]:
df_tx["v4"][0]

In [121]:
df_tx["v4"].str.split("-")

0                [123]
1         [1234, 5678]
2    [010, 1234, 5678]
Name: v4, dtype: object

In [122]:
df_tx["v4"].str.split("-").explode()

0     123
1    1234
1    5678
2     010
2    1234
2    5678
Name: v4, dtype: object

In [123]:
df_tx_v4 = df_tx["v4"].str.split("-", expand = True)
df_tx_v4

      0     1     2
0   123  None  None
1  1234  5678  None
2   010  1234  5678

In [127]:
df_tx_v4_2 = df_tx_v4.add_prefix("v4_")
df_tx_v4_2

   v4_0  v4_1  v4_2
0   123  None  None
1  1234  5678  None
2   010  1234  5678

In [128]:
df_tx_v4_3 = df_tx_v4_2.fillna("🥗")
df_tx_v4_3

   v4_0  v4_1  v4_2
0   123     🥗     🥗
1  1234  5678     🥗
2   010  1234  5678

* 문자 데이터: https://datadoctorblog.com/2023/04/20/Py-Basic-Pandas-String-Data/
* 시간 데이터: https://datadoctorblog.com/2023/04/14/Py-Basic-Pandas-Time-Data/

In [129]:
ser_t1 = pd.Series(["2077-12-18", "2077-12-19", "2077-12-20"])
ser_t2 = pd.Series(["2077년 12월 18일", "2077년 12월 19일", "2077년 12월 20일"])
ser_t3 = pd.Series([20241218, 20241219, 20241220])
ser_t4 = pd.Series([1234, 2345, 3456])

In [131]:
pd.to_datetime(ser_t1)

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [134]:
# pd.to_datetime(ser_t2) # 에러!!!

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [135]:
pd.to_datetime(ser_t2, format = "%Y년 %m월 %d일")

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [138]:
pd.to_datetime(ser_t3)

0   1970-01-01 00:00:00.020241218
1   1970-01-01 00:00:00.020241219
2   1970-01-01 00:00:00.020241220
dtype: datetime64[ns]

In [139]:
pd.to_datetime(ser_t3.astype("str"))

0   2024-12-18
1   2024-12-19
2   2024-12-20
dtype: datetime64[ns]

In [140]:
pd.to_datetime(ser_t4)

0   1970-01-01 00:00:00.000001234
1   1970-01-01 00:00:00.000002345
2   1970-01-01 00:00:00.000003456
dtype: datetime64[ns]

In [141]:
pd.to_datetime(ser_t4, origin = "2070-01-01", unit = "m")

0   2070-01-01 20:34:00
1   2070-01-02 15:05:00
2   2070-01-03 09:36:00
dtype: datetime64[ns]

In [ ]:
import numpy as np

In [153]:
df_bike = pd.read_csv("bike.csv")
df_dt2 = df_bike[["datetime"]].copy()

In [154]:
df_dt2["datetime"] = pd.to_datetime(df_dt2["datetime"])

In [155]:
df_dt2["date"  ] = df_dt2["datetime"].dt.date
df_dt2["yyyymm"] = df_dt2["datetime"].dt.strftime("%Y-%m")
df_dt2["year"  ] = df_dt2["datetime"].dt.year
df_dt2["month" ] = df_dt2["datetime"].dt.month
df_dt2["wday"  ] = df_dt2["datetime"].dt.weekday
df_dt2["wend"  ] = np.where(df_dt2["wday"] >= 5, 1, 0)
df_dt2["hour"  ] = df_dt2["datetime"].dt.hour
df_dt2["dt_s9h"] = df_dt2["datetime"] + pd.to_timedelta(9, unit = "h")

In [156]:
df_dt2.tail()

,datetime,date,yyyymm,year,month,wday,wend,hour,dt_s9h
10881,2012-12-19 19:00:00,2012-12-19,2012-12,2012,12,2,0,19,2012-12-20 04:00:00
10882,2012-12-19 20:00:00,2012-12-19,2012-12,2012,12,2,0,20,2012-12-20 05:00:00
10883,2012-12-19 21:00:00,2012-12-19,2012-12,2012,12,2,0,21,2012-12-20 06:00:00
10884,2012-12-19 22:00:00,2012-12-19,2012-12,2012,12,2,0,22,2012-12-20 07:00:00
10885,2012-12-19 23:00:00,2012-12-19,2012-12,2012,12,2,0,23,2012-12-20 08:00:00

In [157]:
df_dt = pd.DataFrame(dict(date = ["2077-08-01", "2077-08-02", "2077-08-03"]))
df_dt["origin"] = "2077-01-01"
df_dt["date"  ] = pd.to_datetime(df_dt["date"])
df_dt["origin"] = pd.to_datetime(df_dt["origin"])
df_dt["diff"  ] = df_dt["date"] - df_dt["origin"]
df_dt["diff_d"] = df_dt["diff"].dt.days
df_dt

        date     origin     diff  diff_d
0 2077-08-01 2077-01-01 212 days     212
1 2077-08-02 2077-01-01 213 days     213
2 2077-08-03 2077-01-01 214 days     214

In [158]:
df_dt.dtypes

date       datetime64[ns]
origin     datetime64[ns]
diff      timedelta64[ns]
diff_d              int64
dtype: object

In [160]:
df_t = pd.DataFrame(dict(date = pd.date_range("2024-01-01", "2024-01-07"),
                         v = [100, 200, 300, np.nan, 500, 600, 700]))
df_t["v_s1" ] = df_t["v"].shift(1)
df_t["v_s2" ] = df_t["v"].shift(2)
df_t["v_sn1"] = df_t["v"].shift(-1)
df_t["v_fill_1"] = np.where(df_t["v"].isna(),
                            (df_t["v_s1"] + df_t["v_sn1"]) / 2,
                            df_t["v"])
df_t["v_fill_2"] = df_t["v"].interpolate()

In [161]:
df_t

        date      v   v_s1   v_s2  v_sn1  v_fill_1  v_fill_2
0 2024-01-01  100.0    NaN    NaN  200.0     100.0     100.0
1 2024-01-02  200.0  100.0    NaN  300.0     200.0     200.0
2 2024-01-03  300.0  200.0  100.0    NaN     300.0     300.0
3 2024-01-04    NaN  300.0  200.0  500.0     400.0     400.0
4 2024-01-05  500.0    NaN  300.0  600.0     500.0     500.0
5 2024-01-06  600.0  500.0    NaN  700.0     600.0     600.0
6 2024-01-07  700.0  600.0  500.0    NaN     700.0     700.0

In [ ]:
df_e = pd.read_csv("elec_load_2017_7d.csv")
df_e.head(2)

In [ ]:
df_e_m = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"])
df_e_m.head()

In [ ]:
df_e_m = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"], var_name = "HOUR", value_name = "LOAD")
df_e_m.tail()

* 정규표현식: https://datadoctorblog.com/2024/09/20/Py-TM-regex-01-Introduction/

In [169]:
# regex: regular expression(정규표현식)
df_e_m["h1"] = df_e_m["HOUR"].str.replace("X", "").str.replace("HR", "")
df_e_m["h2"] = df_e_m["HOUR"].str.replace("X|HR", "", regex = True)
df_e_m["h3"] = df_e_m["HOUR"].str.replace("[A-Z]", "", regex = True)
df_e_m["h4"] = df_e_m["HOUR"].str.replace("[^0-9]", "", regex = True)
df_e_m["h5"] = df_e_m["h4"].astype("int")

In [ ]:
df_e_m.tail()

In [ ]:
df_e_m.dtypes

In [174]:
df = pd.read_csv("diamonds.csv")

In [ ]:
df.head(2)

In [180]:
pd.crosstab(index = df["cut"], columns = df["color"], values = df["price"],
            aggfunc = "mean")

color,D,E,F,G,H,I,J
cut,,,,,,,
Fair,4291.061350,3682.312500,3827.003205,4239.254777,5135.683168,4685.445714,4975.655462
Good,3405.382175,3423.644159,3495.750275,4123.482204,4276.254986,5078.532567,4574.172638
Ideal,2629.094566,2597.550090,3374.939362,3720.706388,3889.334831,4451.970377,4918.186384
Premium,3631.292576,3538.914420,4324.890176,4500.742134,5216.706780,5946.180672,6294.591584
Very Good,3470.467284,3214.652083,3778.820240,3872.753806,4535.390351,5255.879568,5103.513274

In [ ]:
df.groupby(["cut", "color"])["price"].mean()

In [ ]:
df.pivot_table(index = "cut", columns = "color", values = "price", aggfunc = "mean")

In [183]:
pd.crosstab(index = df["cut"], columns = df["color"], values = df["price"],
            aggfunc = lambda x: round(x.mean(), 1))

color           D       E       F       G       H       I       J
cut
Fair       4291.1  3682.3  3827.0  4239.3  5135.7  4685.4  4975.7
Good       3405.4  3423.6  3495.8  4123.5  4276.3  5078.5  4574.2
Ideal      2629.1  2597.6  3374.9  3720.7  3889.3  4452.0  4918.2
Premium    3631.3  3538.9  4324.9  4500.7  5216.7  5946.2  6294.6
Very Good  3470.5  3214.7  3778.8  3872.8  4535.4  5255.9  5103.5

* merge: https://datadoctorblog.com/2023/05/22/Py-Basic-Pandas-Merge/

In [ ]:
df_bike = pd.read_csv("bike.csv")
df_bike.head(1)

In [185]:
df_b1 = df_bike.iloc[ :4, 4:7]
df_b2 = df_bike.iloc[1:5, 5:8]

In [ ]:
pd.concat([df_b1, df_b2])

In [191]:
pd.concat([df_b1, df_b2], axis = 1)

   weather  temp   atemp  temp   atemp  humidity
0      1.0  9.84  14.395   NaN     NaN       NaN
1      1.0  9.02  13.635  9.02  13.635      80.0
2      1.0  9.02  13.635  9.02  13.635      80.0
3      1.0  9.84  14.395  9.84  14.395      75.0
4      NaN   NaN     NaN  9.84  14.395      75.0

In [193]:
# df_ck = pd.concat([df_b1, df_b2], axis = 1)
# df_ck["temp"]

In [194]:
pd.concat([df_b1, df_b2.reset_index(drop = True).add_suffix("_y")], axis = 1)

   weather  temp   atemp  temp_y  atemp_y  humidity_y
0        1  9.84  14.395    9.02   13.635          80
1        1  9.02  13.635    9.02   13.635          80
2        1  9.02  13.635    9.84   14.395          75
3        1  9.84  14.395    9.84   14.395          75

In [ ]:
pd.merge()

In [196]:
df_b1.sum(axis = 1)

0    25.235
1    23.655
2    23.655
3    25.235
dtype: float64

In [197]:
df_b1.apply(lambda x: x.sum(), axis = 1)

0    25.235
1    23.655
2    23.655
3    25.235
dtype: float64